Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: When you have a working mouse, it is easy: Move the mouse pointer to the status line that separates two windows, and drag it up or down.
es_es: Cuando tiene un ratón, es fácil: Coloque el puntero en la línea de estado que separa las dos ventanas y arrástrela.

source: Both of these commands take a count and increase or decrease the window size by that many lines.
es_es: Ambas órdenes reciben un multiplicador que modificará la altura de ventana ese número de líneas.

source: Thus "4 CTRL-W +" make the window four lines higher.
es_es: «4 CTRL-W +» hará la ventana cuatro líneas más alta.

source: That's: a number {height}, CTRL-W and then an underscore (the - key with Shift on English-US keyboards).
es_es: O sea: un número {altura}, CTRL-W y luego un guión bajo (Mayúsculas más la tecla -).

source: To make a window as high as it can be, use the CTRL-W _ command without a count.
es_es: Para maximizar una ventana, use la orden CTRL-W _ sin ningún multiplicador ni argumento.

source: In Vim you can do many things very quickly from the keyboard.
es_es: En Vim puede hacer muchas cosas muy rápidamente desde el teclado.

source: Unfortunately, the window resizing commands require quite a bit of typing.
es_es: Por desgracia, las órdenes de ajuste de las ventanas requieren mucho trabajo.

source: In this case, using the mouse is faster.
es_es: En este caso, usar el ratón es más rápido.

source: Position the mouse pointer on a status line.
es_es: Coloque el ratón sobre la línea de estado.

source: Now press the left mouse button and drag.
es_es: Ahora presione el botón izquierdo y arrastre.

source: The status line will move, thus making the window on one side higher and the other smaller.
es_es: La línea de estado se desplazará, ajustando el tamaño de la ventana.

source: The 'winheight' option can be set to a minimal desired height of a window and 'winminheight' to a hard minimum height.
es_es: La opción 'winheight' se puede ajustar a una altura mínima de ventana y 'winminheight' a un mínimo estricto.

source: Likewise, there is 'winwidth' for the minimal desired width and 'winminwidth' for the hard minimum width.
es_es: Del mismo modo, hay un ancho 'winwidth' para el ancho mínimo deseado y un 'winminheight' para un ancho mínimo estricto.

source: The 'equalalways' option, when set, makes Vim equalize the windows sizes when a window is closed or opened.
es_es: La opción 'equalalways', cuando está activa, hace que Vim equilibre el tamaño de las ventanas cuando éstas se cierran o se abren nuevas.

source: The ":split" command creates the new window above the current one.
es_es: La orden «:split» crea una nueva ventana sobre la actual.

source: To make the window appear at the left side, use: >
es_es: Para hacer que una ventana aparezca en el lateral izquierda, use: >

source: There is also the ":vnew" command, to open a vertically split window on a new, empty file.
es_es: También hay una orden «:vnew», para abrir una partición vertical con un archivo nuevo.

source: The ":vertical" command can be inserted before another command that splits a window.
es_es: La orden «:vertical» se puede insertar justo antes de otra orden que divida la ventana.

source: This will cause that command to split the window vertically instead of horizontally.
es_es: Esto puede hacer que la ventana se divida verticalmente en lugar de horizontalmente.

source: (If the command doesn't split a window, it works unmodified.)
es_es: (Si la orden no divide ventanas se ejecuta de modo normal.)

source: Since you can split windows horizontally and vertically as much as you like, you can create almost any layout of windows.
es_es: Ya que puede dividir ventanas horizontal y verticalmente a voluntad, puede crear casi cualquier estructura.

source: Then you can use these commands to move between them:
es_es: Una vez las haya creado se puede desplazar por ellas:

source: You will notice the same letters as used for moving the cursor.
es_es: Se habrá dado cuenta de que son las mismas teclas empleadas para mover el cursor.

source: And the cursor keys can also be used, if you like.
es_es: También puede usar las teclas de flechas si lo desea.

source: More commands to move to other windows: |Q_wi|.
es_es: Más órdenes para moverse a otras ventanas: |Q_wi|.

source: You have split a few windows, but now they are in the wrong place.
es_es: Imagine que ha creado unas cuantas ventanas, pero están en el lugar equivocado.

source: Then you need a command to move the window somewhere else.
es_es: Necesitará una orden para mover las ventanas a otro lugar.

source: For example, you have three windows like this:
es_es: Por ejemplo, tiene tres ventanas como estas:

source: Clearly the last one should be at the top.
es_es: Obviamente la última ventana debería estar en la parte superior.

source: Go to that window (using CTRL-W w) and the type this command: >
es_es: Vaya a esa ventana (usando CTRL-W w) y luego teclee la siguiente orden: >

source: When you have several windows open and you want to quit Vim, you can close each window separately.
es_es: Cuando tiene varias ventanas abiertas y quiere salir de Vim, puede cerrar cada ventana por su cuenta.

source: A quicker way is using this command: >
es_es: Una forma más rápida es la siguiente: >

source: This stands for "quit all".
es_es: Esto viene de «quit all» (cerrar todo).

source: If any of the windows contain changes, Vim will not exit.
es_es: Si alguna de las ventanas contiene cambios, Vim no saldrá.

source: The cursor will automatically be positioned in a window with changes.
es_es: El cursor se pondrá automáticamente en la ventana con cambios.

source: You can then either use ":write" to save the changes, or ":quit!" to throw them away.
es_es: Puede usar «:w» para guardar los cambios, o «:q!» para eliminarlos completamente.

source: This stands for "write all".
es_es: Esto viene de «write all» (escribir/guardar todo).

source: But actually, it only writes files with changes.
es_es: Pero, de hecho, sólo escribe archivos con cambios.

source: Vim knows it doesn't make sense to write files that were not changed.
es_es: Vim sabe que no tiene sentido guardar archivos sin cambios.

source: And then there is the combination of ":qall" and ":wall": the "write and quit all" command: >
es_es: También hay una combinación de «:qall» y «:wall»: la orden «guardar y salir de todas las ventanas»: >

source: This writes all modified files and quits Vim.
es_es: Esto guarda todos los archivos modificados y sale de Vim.

source: Finally, there is a command that quits Vim and throws away all changes: >
es_es: Por último, hay una orden que sale de Vim y no guarda nada: >

source: The "-O" argument is used to get vertically split windows.
es_es: El argumento «-O"» se usa para que las divisiones se hagan verticalmente.

source: When Vim is already running, the ":all" command opens a window for each file in the argument list.
es_es: Cuando Vim está ejecutándose, la orden «:all» abre una ventana para cada archivo en la lista de argumentos.

source: ":vertical all" does it with vertical splits.
es_es: «:vertical all» lo hace verticalmente.

source: There is a special way to start Vim, which shows the differences between two files.
es_es: Existe una manera especial de arrancar Vim que muestra las diferencias entre dos archivos.

source: Let's take a file "main.c" and insert a few characters in one line.
es_es: Cojamos un archivo «main.c» e insertemos unos caracteres en una línea.

source: Write this file with the 'backup' option set, so that the backup file "main.c~" will contain the previous version of the file.
es_es: Escriba el archivo con la opción 'backup' activada, de manera que el archivo «main.c~» contendrá la versión anterior.

source: Type this command in a shell (not in Vim): >
es_es: Escribe la siguiente orden en una consola (no en Vim): >

source: Vim will start, with two windows side by side.
es_es: Vim arrancará con dos ventanas verticales.

source: You will only see the line in which you added characters, and a few lines above and below it.
es_es: Verá solamente la línea en la que ha añadido los cambios y unas cuántas líneas por debajo.

source: The lines that were not modified have been collapsed into one line.
es_es: Las líneas que no se modificaron se han agrupado en una sola línea.

source: This is called a closed fold.
es_es: A esto se le denomina pliegue (fold) cerrado.

source: They are indicated in the picture with "<- fold".
es_es: Se indican con «<- pliegue» en la figura.

source: Thus the single fold line at the top stands for 123 text lines.
es_es: La línea de arriba marca que hay 123 líneas.

source: These lines are equal in both files.
es_es: Estas líneas son iguales en ambos archivos.

source: The line marked with "<- changed line" is highlighted, and the inserted text is displayed with another color.
es_es: La línea marcada con «<- línea modificada» está resaltada y el texto insertado se muestra con otro color.

source: This clearly shows what the difference is between the two files.
es_es: Esto muestra claramente las diferencias entre los dos archivos.

source: The line that was deleted is displayed with "---" in the main.c window.
es_es: La línea que se eliminó se muestra con «---» en la ventana «main.c».

source: See the "<- deleted line" marker in the picture.
es_es: Observe el «<- línea eliminada» en la figura.

source: These characters are not really there.
es_es: Estos caracteres no están ahí realmente.

source: They just fill up main.c, so that it displays the same number of lines as the other window.
es_es: Simplemente llenan el espacio necesario en «main.c» para que ambos archivos tengan el mismo número de líneas.

source: Each window has a column on the left with a slightly different background.
es_es: Cada ventana tiene una columna en la izquierda que tiene un fondo ligeramente diferente.

source: In the picture above these are indicated with "VV".
es_es: En la figura de arriba se indican con «VV».

source: You notice there is a plus character there, in front of each closed fold.
es_es: Fíjese que hay un carácter «+» en ese sitio, enfrente de cada pliegue cerrado.

source: Move the mouse pointer to that plus and click the left button.
es_es: Mueva el puntero del ratón a ese signo «+» y pulse el botón izquierdo.

source: The fold will open, and you can see the text that it contains.
es_es: Esto abrirá el pliegue, mostrando el texto que contiene.

source: The fold column contains a minus sign for an open fold.
es_es: La columna del pliegue muestra un «-» para un pliegue abierto.

source: If you click on this -, the fold will close.
es_es: Si pulsa este «-», el pliegue se cerrará.

source: Obviously, this only works when you have a working mouse.
es_es: Obviamente, esto sólo funciona cuando tiene un ratón configurado.

source: You can also use "zo" to open a fold and "zc" to close it.
es_es: También puedes usar «zo» para abrir un pliegue y «zc» para cerrarlo.

source: Another way to start in diff mode can be done from inside Vim.
es_es: Otra manera de iniciar el modo diff es hacerlo desde Vim.

source: Edit the "main.c" file, then make a split and show the differences: >
es_es: Edite el archivo «main.c», haga después un «split» y muestre las diferencias: >

source: The ":vertical" command is used to make the window split vertically.
es_es: La orden «:vertical» se usa para hacer que las ventanas se dividan verticalmente.

source: If you omit this, you will get a horizontal split.
es_es: Si omite esto, obtendrá una división horizontal.

source: If you have a patch or diff file, you can use the third way to start diff mode.
es_es: Si tiene un parche o un archivo diff, puede usarlo como una tercera manera de iniciar el modo diff.

source: First edit the file to which the patch applies.
es_es: Primero edite el archivo sobre el cuál se aplica el parche.

source: Then tell Vim the name of the patch file: >
es_es: Entonces escribe la siguiente orden: >

source: WARNING: The patch file must contain only one patch, for the file you are editing.
es_es: AVISO: El parche debe contener un solo parche, el del archivo que está editando.

source: Otherwise you will get a lot of error messages, and some files might be patched unexpectedly.
es_es: En caso contrario, recibirá muchos de mensajes de error y algunos archivos pueden verse parcheados de forma imprevista.

source: The patching will only be done to the copy of the file in Vim.
es_es: El parcheo será realizado sólo sobre una copia del archivo en Vim.

source: The file on your harddisk will remain unmodified (until you decide to write the file).
es_es: El archivo del disco duro no se modificará hasta que no lo guardes.

source: When the files have more changes, you can scroll in the usual way.
es_es: Cuando los archivos tienen muchos cambios, puede desplazarse de manera normal.

source: Vim will try to keep both the windows start at the same position, so you can easily see the differences side by side.
es_es: Vim intentará hacer que ambas ventanas comiencen con el mismo desplazamiento, para que pueda ver las diferencias en cada lado.

source: When you don't want this for a moment, use this command: >
es_es: Cuando no quiera que esto ocurra, use lo siguiente: >

source: When you have disabled folding in some way, it may be difficult to find the changes.
es_es: Cuando haya desactivado los pliegues de algún modo, puede ser más difícil encontrar los cambios.

source: Use this command to jump forward to the next change: >
es_es: Use esta orden para saltar al siguiente cambio: >

source: You can move text from one window to the other.
es_es: Puede mover texto de una ventana a otra.

source: This either removes differences or adds new ones.
es_es: Esto elimina diferencias o añade unas nuevas.

source: Vim doesn't keep the highlighting updated in all situations.
es_es: Vim no mantiene el texto resaltado en todas las situaciones.

source: To update it use this command: >
es_es: Para actualizarlo deberá escribir: >

source: To remove a difference, you can move the text in a highlighted block from one window to another.
es_es: Para eliminar una diferencia, puede mover el texto de un bloque resaltado desde una ventana a otra.

source: Take the "main.c" and "main.c~" example above.
es_es: Suponga el «main.c» y el «main.c~» del ejemplo.

source: Move the cursor to the left window, on the line that was deleted in the other window.
es_es: Mueva el cursor a la izquierda de la ventana, sobre la línea que se eliminó en la otra ventana.

source: The change will be removed by putting the text of the current window in the other window.
es_es: El cambio se eliminará poniendo el texto de la ventana actual en la otra ventana.

source: "dp" stands for "diff put".
es_es: «dp» viene de «diff put» (put = poner).

source: You can also do it the other way around.
es_es: Puede hacerlo también de la forma completamente opuesta.

source: Move the cursor to the right window, to the line where "changed" was inserted.
es_es: Mueva el cursor a la ventana de la derecha, donde se insertó el cambio.

source: The change will now be removed by getting the text from the other window.
es_es: El cambio será ahora eliminado obteniendo el texto desde la otra ventana.

source: Since there are no changes left now, Vim puts all text in a closed fold.
es_es: Ya que no hay cambios restantes, Vim pondrá todo el texto en un pliegue cerrado.

source: "do" stands for "diff obtain".
es_es: «do» viene de «diff obtain» (obtain = obtener).

source: "dg" would have been better, but that already has a different meaning ("dgg" deletes from the cursor until the first line).
es_es: «dg» podría ser mejor (de g = get = obtener) pero «dgg» ya tenía un significado diferente.

source: Many commands that edit another file have a variant that splits the window.
es_es: Muchas órdenes que editan otro archivo disponen de una variante que divide la ventana.

source: For Command-line commands this is done by prepending an "s".
es_es: Para los de la línea de órdenes se hace con el prefijo «s».

source: For example: ":tag" jumps to a tag, ":stag" splits the window and jumps to a tag.
es_es: Por ejemplo «:tag» salta a una etiqueta, «:stag» divide la ventana y salta a la etiqueta.

source: For Normal mode commands a CTRL-W is prepended.
es_es: Para órdenes del modo normal se teclea CTRL-W antes.

source: CTRL-^ jumps to the alternate file, CTRL-W CTRL-^ splits the window and edits the alternate file.
es_es: CTRL-^ salta al archivo alterno, CTRL-W CTRL-^ divide la ventana y edita el archivo alterno.

source: The 'splitbelow' option can be set to make a new window appear below the current window.
es_es: Puede activar la opción 'splitbelow' para hacer que la nueva ventana aparezca debajo de la actual.

source: The 'splitright' option can be set to make a vertically split window appear right of the current window.
es_es: Puede activar la opción 'splitright' para hacer que una partición vertical aparezca a la derecha de la ventana actual.

source: You will have noticed that windows never overlap.
es_es: Habrá notado que las ventanas no se superponen.

source: That means you quickly run out of screen space.
es_es: Esto significa que puede rápidamente acabar sin espacio suficiente.

source: The solution for this is called Tab pages.
es_es: La solución son las pestañas:

source: Assume you are editing "thisfile".
es_es: Suponga que está editando «estearchivo».

source: To create a new tab page use this command: >
es_es: Para crear una nueva pestaña: >

source: This will edit the file "thatfile" in a window that occupies the whole Vim window.
es_es: Esto editará el archivo «aquélarchivo» en una ventana que ocupe todo el espacio de Vim.

source: And you will notice a bar at the top with the two file names:
es_es: Verá que hay una nueva barra en la parte superior:

source: You now have two tab pages.
es_es: Ahora tiene dos pestañas.

source: The first one has a window for "thisfile" and the second one a window for "thatfile".
es_es: La primera tiene una ventana para «estearchivo» y la segunda para «aquélarchivo».

source: It's like two pages that are on top of eachother, with a tab sticking out of each page showing the file name.
es_es: Es como dos páginas una encima de la otra, con una pestaña sobresaliendo de cada página.

source: Thus you can switch between tab pages by clicking on the label in the top line.
es_es: De este modo puede pasar entre pestañas pulsando sobre la etiqueta de la línea superior.

source: If you don't have a mouse or don't want to use it, you can use the "gt" command.
es_es: Si no dispone del ratón o no lo quiere usar, puede emplear la orden «gt».

source: Mnemonic: Goto Tab.
es_es: Nemotecnia: Goto Tab (ir a pestaña).

source: You can put ":tab" before any Ex command that opens a window.
es_es: Puede poner «:tab» antes de cualquier orden «Ex» que abra una ventana.

source: The window will be opened in a new tab page.
es_es: La ventana se abrirá en una nueva ventana.

source: - click with the mouse on the "X" in the top right corner The current tab page will be closed.
es_es: - pulse con el ratón sobre la «X» en la esquina superior derecha.

source: Unless there are unsaved changes in the current tab page.
es_es: La pestaña actual se cerrará a menos que haya cambios sin guardar en la pestaña.

source: *usr_02.txt* For Vim version 7.3.
es_es: *usr_02.esx* Para Vim versión 7.3.

source: This chapter provides just enough information to edit a file with Vim.
es_es: Este capítulo ofrece suficiente información para editar un archivo con Vim.

source: Not well or fast, but you can edit.
es_es: No bien ni rápido, pero podrá editar.

source: Take some time to practice with these commands, they form the base for what follows.
es_es: Tómese un tiempo para practicar estas órdenes, son la base de lo que sigue.

source: In UNIX you can type this at any command prompt.
es_es: En UNIX puede introducir esta orden en cualquier interprete de órdenes.

source: If you are running Microsoft Windows, open an MS-DOS prompt window and enter the command.
es_es: Si está bajo Microsoft Windows, abra una terminal de MS-DOS e introduzca la orden.

source: In either case, Vim starts editing a file called file.txt.
es_es: En ambos casos, Vim se inicia con la edición de un archivo llamado file.txt.

source: Because this is a new file, you get a blank window.
es_es: Ya que es un archivo nuevo, obtendrá un ventana vacía.

source: This is what your screen will look like:
es_es: Así es como su pantalla debería aparecer:

source: The tilde (~) lines indicate lines not in the file.
es_es: Las líneas con tilde (~) indican líneas que no se hallan en el archivo.

source: In other words, when Vim runs out of file to display, it displays tilde lines.
es_es: En otras palabras, cuando Vim se queda sin archivo que mostrar muestra líneas con tilde.

source: At the bottom of the screen, a message line indicates the file is named file.txt and shows that you are creating a new file.
es_es: En la parte inferior de la pantalla, un mensaje muestra que el archivo se llama file.txt y que está creando un archivo nuevo.

source: The message information is temporary and other information overwrites it.
es_es: La información del mensaje es temporal y otra información la sobreescribirá.

source: The gvim command causes the editor to create a new window for editing.
es_es: La orden «gvim» hace que el editor cree una nueva ventana para editar.

source: If you use this command: >
es_es: Si usa la orden: >

source: the editing occurs inside your command window.
es_es: la edición ocurre dentro de la ventana de llamada.

source: In other words, if you are running inside an xterm, the editor uses your xterm window.
es_es: En otras palabras, si está dentro de una xterm, el editor usa su ventana xterm.

source: If you are using an MS-DOS command prompt window under Microsoft Windows, the editing occurs inside this window.
es_es: Si está usando una terminal de MS-DOS bajo Windows, la edición tendrá lugar dentro de esta ventana.

source: The text in the window will look the same for both versions, but with gvim you have extra features, like a menu bar.
es_es: El texto en la ventana tendrá el mismo aspecto en ambas versiones, pero con gvim tiene características extra, como una barra de menú.

source: More about that later.
es_es: Volveremos a este punto posteriormente.

source: After typing "turtle" you press the <Enter> key to start a new line.
es_es: Tras teclear «turtle», pulse la tecla <Intro> para comenzar una nueva línea.

source: Finally you press the <Esc> key to stop Insert mode and go back to Normal mode.
es_es: Por último, presione la tecla <Esc> para salir del modo Insertar y volver al modo Normal.

source: You now have two lines of text in your Vim window:
es_es: Ahora tienes dos línea de texto en su ventana de Vim:

source: You will notice that when typing the colon Vim moves the cursor to the last line of the window.
es_es: Comprobará que cuando introduce dos puntos, Vim desplaza el cursor a la última línea de la ventana.

source: That's where you type colon commands (commands that start with a colon).
es_es: Allí es donde introducirá órdenes con dos puntos (órdenes que comienzan con dos puntos).

source: Finish this command by pressing the <Enter> key (all commands that start with a colon are finished this way).
es_es: Finalice la orden presionando la tecla <Intro> (todas estas órdenes se finalizan de este modo).

source: Now, if you type the "i" command Vim will display --INSERT-- at the bottom of the window.
es_es: Si pulsase ahora la orden «i», Vim mostrará --INSERT-- en la parte inferior de la ventana.

source: This indicates you are in Insert mode.
es_es: Esto indica que está en el modo Insertar.
